demo/app/controllers/posts_controller.rb

  def index
    @posts = Post.order(updated_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."updated_at" DESC